// array2 2.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//

#include <iostream>
using namespace std;

int main()
{
	int i, j;
	float a[2][2];
	float b[2][2];
	float c[2][2];
	for(i=0;i<2;i++)
	{
		for (j = 0; j < 2; j++)cin >> a[i][j];
	}
	float beta = a[0][0] * a[1][1] - a[0][1] * a[1][0];
	if(beta==0)
	{
		cout << "无逆矩阵";
		return 0;
	}
	b[0][0] = a[1][1] / beta;
	b[0][1] = -a[0][1] / beta;
	b[1][0] = -a[1][0] / beta;
	b[1][1] = a[0][0] / beta;
	cout << "逆矩阵是：\n";
	printf("%f %f\n%f %f\n", b[0][0], b[0][1], b[1][0], b[1][1]);
	for (i = 0; i < 2; i++)
	{
		for (j = 0; j < 2; j++)c[i][j] = a[i][0] * b[0][j] + a[i][1] * b[1][j];
	}
	cout << "检验：\n";
	printf("%.0f %.0f\n%.0f %.0f", c[0][0], c[0][1], c[1][0], c[1][1]);
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
